{
  "human": {
    "name": "Human",
    "description": "Born of fractured stardust and untamed will, Humans stand as the crucible where destiny is forged anew. Their path is not set by ancient decree but by the relentless hunger of a spirit unbound, capable of weaving any tapestry of power, given but a thread of ambition.",
    "emoji_id": "human_icon_emoji_id",
    "base_hp": 100,
    "base_attack": 10,
    "base_defense": 10,
    "base_speed": 10,
    "visual_asset_path": "assets/classes/human/human_base.png"
  },
  "astral": {
    "name": "Astral",
    "description": "Echoes of the cosmic void, Astrals are beings woven from pure starlight and primordial nebulae. Their essence transcends mortal understanding, granting them unparalleled command over ethereal energies and the silent symphony of the cosmos itself. They are the gaze of infinity.",
    "emoji_id": "astral_icon_emoji_id",
    "base_hp": 90,
    "base_attack": 15,
    "base_defense": 9,
    "base_speed": 14,
    "visual_asset_path": "assets/classes/astral/astral_base.png" 
  },
  "elf": {
    "name": "Elf",
    "description": "Whispers of ancient forests and starlight flow through Elven veins, granting them a grace born of timeless æther. Their movements are poetry, their arrows extensions of a will that bends the very fabric of air. They are the unseen dance of twilight and dawn.",
    "emoji_id": "elf_icon_emoji_id",
    "base_hp": 85,
    "base_attack": 12,
    "base_defense": 7,
    "base_speed": 13,
    "visual_asset_path": "assets/classes/elf/elf_base.png"
  },
  "demon": {
    "name": "Demon",
    "description": "Forged in the searing crucible of forgotten hells, Demons wield the chaotic might of primordial destruction. Their power is a pact with the abyss, an untamed inferno that scorches the very soul of their foes. They are the roaring silence of oblivion.",
    "emoji_id": "demon_icon_emoji_id",
    "base_hp": 95,
    "base_attack": 18,
    "base_defense": 6,
    "base_speed": 9,
    "visual_asset_path": "assets/classes/demon/demon_base.png" 
  },
  "angel": {
    "name": "Angel",
    "description": "Celestial beings of light and healing, angels protect allies and smite foes with divine energy. Their presence heralds divine judgment or ethereal solace, their might a hymn of creation and a shield against encroaching darkness.",
    "emoji_id": "angel_icon_emoji_id",
    "base_hp": 110,
    "base_attack": 10,
    "base_defense": 12,
    "base_speed": 8,
    "visual_asset_path": "assets/classes/angel/angel_base.png" 
  },
  "orc": {
    "name": "Orc",
    "description": "Born of the earth's raw fury and tempered by endless conflict, Orcs are living engines of brutal, unyielding force. Their might is a testament to primal strength, their will a thunderous roar that shatters lesser beings. They are the relentless, crushing tide.",
    "emoji_id": "orc_icon_emoji_id",
    "base_hp": 130,
    "base_attack": 14,
    "base_defense": 10,
    "base_speed": 6,
    "visual_asset_path": "assets/classes/orc/orc_base.png" 
  }
}